### <center> Multi Index and Index Hierarchy

### Lets create a data frame with multi index and Hierarchy

In [1]:
import pandas as pd 
import numpy as np

In [2]:
inside = ['class A', 'class B', 'class C','class A', 'class B', 'class C']

In [3]:
outside = ["school 1", "school 1","school 1", "school 2", "school 2","school 2"]

In [4]:
zip(outside, inside)

In [5]:
multi_index = list(zip(outside, inside))

In [6]:
multi_index

[('school 1', 'class A'),
 ('school 1', 'class B'),
 ('school 1', 'class C'),
 ('school 2', 'class A'),
 ('school 2', 'class B'),
 ('school 2', 'class C')]

In [7]:
hier_index = pd.MultiIndex.from_tuples(multi_index)

In [8]:
hier_index

MultiIndex([('school 1', 'class A'),
            ('school 1', 'class B'),
            ('school 1', 'class C'),
            ('school 2', 'class A'),
            ('school 2', 'class B'),
            ('school 2', 'class C')],
           )

In [10]:
np.random.seed(0)
data = pd.DataFrame(np.random.randint(70, 100, size = (6,2)), index=hier_index, columns=['1st_sem', '2nd_sem'])

In [11]:
data

                  1st_sem  2nd_sem
school 1 class A       82       85
         class B       91       70
         class C       73       97
school 2 class A       73       77
         class B       79       89
         class C       91       88

### <center> Element selection in Multi-indexed data frames

In [12]:
data[["1st_sem"]]

                  1st_sem
school 1 class A       82
         class B       91
         class C       73
school 2 class A       73
         class B       79
         class C       91

In [13]:
data[['2nd_sem']]

                  2nd_sem
school 1 class A       85
         class B       70
         class C       97
school 2 class A       77
         class B       89
         class C       88

In [14]:
data.loc['school 1']

         1st_sem  2nd_sem
class A       82       85
class B       91       70
class C       73       97

In [15]:
data.loc['school 1'].loc['class B']

1st_sem    91
2nd_sem    70
Name: class B, dtype: int32

In [16]:
data.loc['school 1'].loc[['class B']]

         1st_sem  2nd_sem
class B       91       70

In [17]:
data.index

MultiIndex([('school 1', 'class A'),
            ('school 1', 'class B'),
            ('school 1', 'class C'),
            ('school 2', 'class A'),
            ('school 2', 'class B'),
            ('school 2', 'class C')],
           )

In [18]:
data.index.names

FrozenList([None, None])

In [19]:
data.index.names = ['schools', 'classes']

In [20]:
data

                  1st_sem  2nd_sem
schools  classes
school 1 class A       82       85
         class B       91       70
         class C       73       97
school 2 class A       73       77
         class B       79       89
         class C       91       88